InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/GPIO/Header/Peripheral/Register/RegisterDefines/GPIO_RegisterDefines_DEN.h
/**
 *
 * @file GPIO_RegisterDefines_DEN.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 25 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 25 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_GPIO_GPIO_PERIPHERAL_GPIO_REGISTER_GPIO_REGISTERDEFINES_GPIO_REGISTERDEFINES_DEN_H_
#define XDRIVER_MCU_DRIVER_HEADER_GPIO_GPIO_PERIPHERAL_GPIO_REGISTER_GPIO_REGISTERDEFINES_GPIO_REGISTERDEFINES_DEN_H_

#include <stdint.h>

/******************************************************************************************
************************************ 18 GPIODEN *********************************************
******************************************************************************************/
/*----------*/
#define GPIO_GPIODEN_R_DEN_MASK             ((uint32_t)0x000000FFu)
#define GPIO_GPIODEN_R_DEN_BIT              (0u)
#define GPIO_GPIODEN_R_DEN_DIS              ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_R_DEN_EN               ((uint32_t)0x000000FFu)

#define GPIO_GPIODEN_DEN_MASK               ((uint32_t)0x000000FFu)
#define GPIO_GPIODEN_DEN_DIS                ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_DEN_EN                 ((uint32_t)0x000000FFu)
/*----------*/

/*----------*/
#define GPIO_GPIODEN_R_DEN0_MASK            ((uint32_t)0x00000001u)
#define GPIO_GPIODEN_R_DEN0_BIT             (0u)
#define GPIO_GPIODEN_R_DEN0_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_R_DEN0_EN              ((uint32_t)0x00000001u)

#define GPIO_GPIODEN_DEN0_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODEN_DEN0_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_DEN0_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODEN_R_DEN1_MASK            ((uint32_t)0x00000002u)
#define GPIO_GPIODEN_R_DEN1_BIT             (1u)
#define GPIO_GPIODEN_R_DEN1_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_R_DEN1_EN              ((uint32_t)0x00000002u)

#define GPIO_GPIODEN_DEN1_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODEN_DEN1_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_DEN1_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODEN_R_DEN2_MASK            ((uint32_t)0x00000004u)
#define GPIO_GPIODEN_R_DEN2_BIT             (2u)
#define GPIO_GPIODEN_R_DEN2_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_R_DEN2_EN              ((uint32_t)0x00000004u)

#define GPIO_GPIODEN_DEN2_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODEN_DEN2_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_DEN2_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODEN_R_DEN3_MASK            ((uint32_t)0x00000008u)
#define GPIO_GPIODEN_R_DEN3_BIT             (3u)
#define GPIO_GPIODEN_R_DEN3_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_R_DEN3_EN              ((uint32_t)0x00000008u)

#define GPIO_GPIODEN_DEN3_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODEN_DEN3_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_DEN3_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODEN_R_DEN4_MASK            ((uint32_t)0x00000010u)
#define GPIO_GPIODEN_R_DEN4_BIT             (4u)
#define GPIO_GPIODEN_R_DEN4_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_R_DEN4_EN              ((uint32_t)0x00000010u)

#define GPIO_GPIODEN_DEN4_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODEN_DEN4_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_DEN4_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODEN_R_DEN5_MASK            ((uint32_t)0x00000020u)
#define GPIO_GPIODEN_R_DEN5_BIT             (5u)
#define GPIO_GPIODEN_R_DEN5_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_R_DEN5_EN              ((uint32_t)0x00000020u)

#define GPIO_GPIODEN_DEN5_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODEN_DEN5_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_DEN5_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODEN_R_DEN6_MASK            ((uint32_t)0x00000040u)
#define GPIO_GPIODEN_R_DEN6_BIT             (6u)
#define GPIO_GPIODEN_R_DEN6_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_R_DEN6_EN              ((uint32_t)0x00000040u)

#define GPIO_GPIODEN_DEN6_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODEN_DEN6_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_DEN6_EN                ((uint32_t)0x00000001u)
/*----------*/

/*----------*/
#define GPIO_GPIODEN_R_DEN7_MASK            ((uint32_t)0x00000080u)
#define GPIO_GPIODEN_R_DEN7_BIT             (7u)
#define GPIO_GPIODEN_R_DEN7_DIS             ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_R_DEN7_EN              ((uint32_t)0x00000080u)

#define GPIO_GPIODEN_DEN7_MASK              ((uint32_t)0x00000001u)
#define GPIO_GPIODEN_DEN7_DIS               ((uint32_t)0x00000000u)
#define GPIO_GPIODEN_DEN7_EN                ((uint32_t)0x00000001u)
/*----------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_GPIO_GPIO_PERIPHERAL_GPIO_REGISTER_GPIO_REGISTERDEFINES_GPIO_REGISTERDEFINES_DEN_H_ */
